Revit 2026 API

# RoutingCriterionBase Properties

---

The RoutingCriterionBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

RoutingCriterionBase Class

Autodesk.Revit.DB Namespace